/**
 * node 的模块化开发
 *  + 在前端 开发的时候
 *      => 可以独立文件开发，在html内依次引入每一个js文件
 *      => 因为你在一个 html 内引入的多个 js 文件，共用一个 全局
 *  + 在 后端 开发的时候
 *      => 直接使用 node 运行某一个 js 文件
 *      => 多个 js 文件之间互相没有关联，没有共同的全局
 *      => 文件只能使用自己文件内书写的代码
 *  + node 的 开发，必须是 模块化 开发
 *      => 因为每一个文件都是相对独立的 js 文件
 *      => 任何一个文件不能随便使用其他文件内的 内容
 *      => 如果你想在 a.js 文件内使用 b.js 内的内容
 *          -> 首先你需要在 b.js 文件内把可以让别人使用的内容 导出
 *          -> 在 a.js 文件内导入 b.js 文件
 *          -> 此时才可以在 a.js 内使用 b.js 内的数据
 *      => node 有自己的模块化开发标准
 *          -> 叫做 CommonJS 模块化开发标准
 *  + node 的模块化开发分成三种
 *      1. 自定义模块
 *      2. 内置模块 
 *      3. 第三方模块
 *          => 不是自己写的，也不是内置模块
 */